
package com.lib.mangement.Test;
import com.lib.mangement.Common.dao.CommonDao;
import static org.junit.Assert.*;

import java.sql.SQLException;
import java.util.Random;

import org.junit.Test;
import org.omg.CORBA.PUBLIC_MEMBER;

import com.lib.mangement.Common.dao.CommonDao;

public class StudentTest{

	@Test
	public void test(){
		String sql="insert into user(id,name,department,class_name,password) values(?,?,?,?,?)";
		//Random random=new Random(System.currentTimeMillis());
		try{
			for(int i=1;i<10001;i++){
				
		//随机学号和密码
			StringBuilder sb=new StringBuilder("2018");
			if(i<10){
				sb.append("0000").append(i);
			}else if(i>=10&&i<100){
				sb.append("000").append(i);				
			}else if(i>=100&&i<1000){
				sb.append("00").append(i);
			}else if(i>=1000&&i<10000){
				sb.append("0").append(i);
			}else{
				sb.append(i);
			}
		
		//随机姓名
	    String firstname="赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊于惠甄曲家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟溥印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴郁胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍却璩桑桂濮牛寿通边扈燕冀浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东欧殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查后荆红游郏竺权逯盖益桓公仉督岳帅缑亢况郈有琴归海晋楚闫法汝鄢涂钦商牟佘佴伯赏墨哈谯篁年爱阳佟言福南火铁迟漆官冼真展繁檀祭密敬揭舜楼疏冒浑挚胶随高皋原种练弥仓眭蹇覃阿门恽来綦召仪风介巨木京狐郇虎枚抗达杞苌折麦庆过竹端鲜皇亓老是秘畅邝还宾闾辜纵侴万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫羊舌尉迟公羊澹台公冶宗正濮阳淳于单于太叔申屠公孙仲孙轩辕令狐钟离宇文长孙慕容鲜于闾丘司徒司空兀官司寇南门呼延子车颛孙端木巫马公西漆雕车正壤驷公良拓跋夹谷宰父谷梁段干百里东郭微生梁丘左丘东门西门南宫第五公仪公乘太史仲长叔孙屈突尔朱东乡相里胡母司城张廖雍门毋丘贺兰綦毋屋庐独孤南郭北宫王孙";
		String lastname="曦洁桃颖韵华璟诗娜霞花可钰优柔萱依颖梅岚紫欣倩冬芸美璐曦凌欢静茹薇琛歆涵莲家瑶寒芙克菲美凌怡怡雪芳歆桃芳玲春颖云洁敏寒曼莉鑫菲格怡敏雯俊依琪雅鑫娅诗莲碧琬栀怡弦格碧雯鹤馨蓓慧静枫霞诗歆蓓琪瑶韵家菡寒桃优珠琪惠珠欣诗莲惠歆颖玉鑫茹丽冬玲梦鹤倩妍婧茜芳梓琳韵春瑶薇栀碧美柔玉丽娜旭玥珊蕾花莲珊桂楠菲露茜凡敏妍沛惠薇雯娜锦璐彦优莉栀洁薇桃桂梅璇桃露阳怡柔梦梦琳雯美旭弦格妮琪格琬花晨萱雨蓓栀瑶惠莉舒颖娜馨梅梦芸璟橘花冬欢倩彩霞蕾敏梅淑琪彤娅淑玲优凡蓓钰灵桂梓橘弦俊梅蕾漫心香紫楠露娜心莉凌莲莲歆云惠琪柔莉正昕珠岚鸿涵优文丽钰桂慧莲涵颖云玲芝依婧柏蓓呈慧桃琛歆娜优桂沛婧倩帛桂柔菲慧采心韵依杉霞芳婧鹤妮欢芳倩柏蓓蔚珊华丽蕾灵彬慧敏娜莲妍岚静蕾呈蔚涵俊静怡采慧鸿婧玲萱桃凌杉珊桐惠香璐冬涵采华岚璇橘芳岚梅菡心欢馨莉诗惠碧冬媛桃曼帛阳琳桃珍梅彤碧慧雪函岚慧依帆桂鹤优凌娜萱昕花俊妮依茹琳漫洲梅碧敏芸心菲欢春花颖蕾莲琬璟钰芸弦栀萱淑林灵馨璟茜昕萱曼雯彬芳珍杉依涵云怡桃静敏漫珍欣璇文雅桂玲函雅阳阳依俊茹玥蕾栀露华采梅妮蓓杉雯昭蓓梦云欣琛馨楠桃涵敏柔曼雪韵莉茹彬莲洁霞橘欣莉鹤月漫鑫蕾玉雅薇茹韵欢帛珊蓓琳露曦婷祥倩玲娜妮彩优静惠凌蓓漫鸿彤曦婧明玲文曼寒采洁碧颖璟婧彤静冰萱曼月梦洁洁雨文慧旭月琪欢寒昕颖初月珊涵珍橘嘉橘雪茹蕾碧桃函杉瑶香娅静芝昭惠妮梅嘉芳栀蕾妍杉月芝旭慧露珍鸿枫涵妍露芙雅芙慧雪优旭茜香灵珍呈静雯娜婷珠薇帛薇芝岚歆敏欢晨梓玲杉美碧碧雪灵玲玥旭珍娜凌枫漫曼俊珍美昕倩莲函玉珊婧蔚优梅菲璟雨淑枫莉漫彬露锦柏妍碧云彤寒霞云沛曼楠香栀莲雨敏薇碧鹤婷杉春露欣雯静敏函珍栀晨娅桃曼柏美珍蕾蓓婧颖香俊菡柔函家琳桐彩碧菲云芝璐娅美楠歆芝惠岚娅蓓芙芝妍凌香林弦惠柔鑫柔妮雅冬钰琬优雅淑妮歆春舒萱锦桂娅梅楠芙欢冰紫凡玲帆函琪灵晨采柔蕾璐梦冰雪娅蕾冬婷昕华欣蔚茹芳娜芳欣莉祥妍花霞凡冬美鑫芙慧蔚函玥琳芙琬婧月梅惠涵妮鑫芙鑫月冰心雯蔚敏珠芸蕾弦璐珍莲林曼祥莲祥蓓敏华曼敏碧芸芸婷优琳鑫云芸璐薇蕾格明瑶琳露婧敏桃梓珍雨露璐芝倩蓓茜欢芝楠倩丽帆俊倩梓婷呈梦杉桃怡鹤杉碧昭珍美莉花芸璟彩曼雅蓓妍娅帆静寒怡美娅雨柔梅冰橘月倩彤美瑶萱文淑云桃瑶敏璇倩彩紫心芙雅岚敏雨云函杉淑倩梓蔚晨欣倩萱紫雨茹桃玲玲珊春薇彤芳鹤惠芸鑫采桐菲楠祥菡涵曦雅颖珠花祥莉花文芸帛莲茹灵妮锦萱茹初灵昕蔚婧娅桐茹倩琬花紫玉琳芳露惠鹤馨楠娜晨芙莲雨梅橘蕾菲雪桃橘淑阳震星良初骞权杞贤祜桓华中远德轩振帝泽华浩鑫梁柔文骞年芃杞振阳卓锐良翱帝峰逸佳福尧炳芃海权斌加梓翱中仕材弘邦俊恒祜颜起子升龙沛彬邦佳吉涛中辞盛宇勇荣天锦澄桓琛谛良锦瑞睿锋喆谷卓浩辞轩奇振年琛龙帝郁鸿奇允鹤晨华裕俊康卓祥胤华祥禄逸晨帝栋中鹏延彬晨初铭权晓鑫瑞胤桓锋海远腾礼濡梓德材铭日勇星谷俊荣吉文晖骏帝勇信锐锦星祯鸿帝澄鹏尧振暄楷谛家轩禧康祜日睿恒文枫运盛运谷权锐福福恒梓初皓楷驰韦仕升礼帝驰星然家强邦柏仕梁禄家颜允佑桓振贤奇安枫谛星槐畅腾康日芃宇凡福柔信卓栋荣诚琛安博寅寅震成禄逸栋坤中勇伟泽骏鹏伟加芃杞铭晓起伟星年邦晨畅彬锐暄允祯濡平材骏卓良钊逸鹤宇震彬锋成杞郁海仕强嘉骏颜博卓钊荣铭驰禄延嘉振成加乘濡翱延林博锋盛芃翱弘晨轩远振中林宇海晖裕子喆祜锦辰栋辞尧晖暄涛德日芃日博枫振潍泽运家驰仕辰邦哲震韦凡福祥芃晖喆骏峰延骏潍龙芃贤卓成泽日谛信禄康辰琛轩阳仕烁翰伟允哲材年驰翰凯坤弘佳邦颜铭濡杞初芃钊楷瑞弘佳寅强槐乘强凯然沛枫寅喆桓斌柏睿皓鹏佑贤晖帆钊然骞禧天博骏畅子帝畅乘柏梁铭祯震尧文权俊泽炳鹤海加暄荣骏翱烁鹤腾权华泽博成韦柏瑞祥谛年起鹤谛畅海晖诚浩信宇锋星梁奇槐祜然卓鹤芃哲起濡宇伟子年海坤德嘉寅然吉翰濡峰远晖钊锐震加颜栋年宇强天坤晖楷锦浩皓初凡帆子震鸿礼斌沛濡暄梓博年然桓峰奇楷凡奇振信权文帆栋睿卓鹤翰远嘉涛诚瑞禄梓寅允濡文仕宇华阳材烁喆林鸿胤骏仕琛家龙德翱祥桓泽子信伟晖诚颜中韦祯帆俊骞阳博帆杰荣帆骞槐烁鸿勇华杰槐楷睿德华寅斌勇年盛尧杰佑子烁祜彬晓睿文柏寅柔礼宇伟延哲强腾佳乘喆寅博骏盛年恒瑞远杰博然鑫锟良加乘中弘延祜平振炳梓辞权晨逸峰彬德烁乘初泽乘禧宇柏文子晨晨弘伟凯晨烁贤梁铭皓杰伟斌琛凡帆翰韦升楷礼博杰骞祯谷材安枫星驰成腾海远柔泽佑邦韦瑞俊欣锋郁嘉奇俊卓伟平材礼畅延钊鹏海琛安翰鹤日佑沛初鹏栋远卓权腾祯子荣龙恒畅诚禄枫澄年轩梁晓荣中锟芃佑栋鹤睿裕澄锋澄权欣槐起康炳皓暄日锦帝乘楷博乘钊睿寅荣安鸿骏博瑞中年梁谷华凡材权骞福德鹤祥郁升鑫驰潍谷韦韦加安斌腾枫裕锋弘阳礼卓韦伟然俊仕礼寅锐杞帝礼材天潍喆祯海钊信德日郁日腾辰哲阳琛楷芃杰华锦鹤佳凯震烁延驰家振伟文平逸寅芃权仕晖伟凡家康佑龙礼乘佑锦勇帆鑫星弘锋家皓日然仕成钊枫禄胤芃喆晓尧安林梁年禄德星涛龙坤龙祜畅家晓禧轩逸驰震仕骞铭振祯骞阳郁平允俊辞锐桓哲喆运振延加祯帆凡天骏驰诚辞祜安荣天德祜锐伟年勇柏谛邦颜诚中允辰翰枫睿嘉鹤睿濡勇邦濡潍允涛禄";
		int index=getNum(0,firstname.length()-1);
		String first=firstname.substring(index,index+1);
		String str=lastname;
        int length=lastname.length();
	    index=getNum(0,length-1);
	    String second=str.substring(index,index+2);
		String name=first+second;
		
	    //随机学院
		String[] depart= {"计算机网络工程","建筑工程","信息技术","劳动技术教育","口腔医学","法医学","美容医学","环境保护学","动物科学","刑事科学技术","消防工程","生物工程","工程力","弹药工程","服装设计","航天测控工程","飞行技术","铁道运输","安全技术","制药工程","测绘工程","土木工程","移动通信","冶金工程","材料物理","生态学","海洋学","地质学","微生物应用技术","理论与应用力学","统计与会计","采矿工程","自动化","水利水电工程","学前教育"};
		int dindex=getNum(0,depart.length-1);
		String dept=depart[dindex];
		
		//随机班级
		int cindex=getNum(1,6);
		String u_class=cindex+"班";
		
		//写入数据库
		CommonDao.executeUpdate(sql, new Object[] {sb.toString(),name,dept,u_class,sb.toString()});
			}
		}
		catch(Exception e){
			//TODO:handleexception
		}
	}
	
	//随机数
	public static int getNum(int start,int end) {
		return (int)(Math.random()*(end-start+1)+start);
	}
	
}
